import pandas as pd

# 데이터 불러오기 
df = pd.read_csv("../../data/raw/서울시 상권분석서비스(길단위인구-행정동).csv", encoding='cp949')

# ---------------------------
# 1. 연도 컬럼 생성 (분기 제거)
# ---------------------------
# 기준_년분기_코드: 예) 20254 → 2025년 4분기
df['기준_년도'] = df['기준_년분기_코드'].astype(str).str[:4].astype(int)

# ---------------------------
# 2. 연 단위로 집계
# ---------------------------
# 그룹 기준 컬럼
group_cols = ['기준_년도', '행정동_코드', '행정동_코드_명']

# 나머지 수치 컬럼 자동 선택
agg_cols = [col for col in df.columns if col not in group_cols + ['기준_년분기_코드']]

# 합계 집계
df_year = df.groupby(group_cols)[agg_cols].sum().reset_index()

# ---------------------------
# 3. 자치구 코드 생성
# ---------------------------
# 행정동 코드 앞 5자리 → 자치구 코드
df_year['자치구_코드'] = df_year['행정동_코드'].astype(str).str[:5].astype(int)

# ---------------------------
# 4. 자치구 이름 매핑
# ---------------------------
gu_map = {
    11110: '종로구', 11140: '중구', 11170: '용산구',
    11200: '성동구', 11215: '광진구', 11230: '동대문구',
    11260: '중랑구', 11290: '성북구', 11305: '강북구',
    11320: '도봉구', 11350: '노원구', 11380: '은평구',
    11410: '서대문구', 11440: '마포구', 11470: '양천구',
    11500: '강서구', 11530: '구로구', 11545: '금천구',
    11560: '영등포구', 11590: '동작구', 11620: '관악구',
    11650: '서초구', 11680: '강남구', 11710: '송파구',
    11740: '강동구'
}

df_year['자치구_코드_명'] = df_year['자치구_코드'].map(gu_map)
gu_code = df_year.pop('자치구_코드')
gu_name = df_year.pop('자치구_코드_명')

df_year.insert(1, '자치구_코드', gu_code)
df_year.insert(2, '자치구_코드_명', gu_name)
# ---------------------------
# 결과 확인
# ---------------------------
print(df_year.head())

df_year.to_csv("../../data/preprocessed/상권분석_길단위인구_행정동_전처리.csv", index=False, encoding='utf-8-sig')