import pandas as pd

# 데이터 불러오기
df = pd.read_csv(
    "../../data/raw/서울시 상권분석서비스(추정매출-행정동).csv",
    encoding="cp949"
)

# ---------------------------
# 0. 컬럼명 공백 제거
# ---------------------------
df.columns = df.columns.str.strip()

# ---------------------------
# 1. 연도 컬럼 생성 (분기 제거)
# ---------------------------

df["행정동_코드"] = pd.to_numeric(df["행정동_코드"], errors="coerce").astype("Int64")
df["기준_년도"] = df["기준_년분기_코드"].astype(str).str[:4].astype(int)
# 결측 있으면 확인
print("행정동_코드 결측 개수:", df["행정동_코드"].isna().sum())


# ---------------------------
# 2. 그룹 기준 컬럼 설정
# ---------------------------
group_cols = [
    "기준_년도",
    "행정동_코드",
    "행정동_코드_명",
    "서비스_업종_코드",
    "서비스_업종_코드_명"
]

# ---------------------------
# 3. 집계할 숫자 컬럼만 선택
# ---------------------------
numeric_cols = df.select_dtypes(include="number").columns.tolist()

# group key / 불필요 컬럼 제외
exclude_cols = ["기준_년분기_코드", "기준_년도", "행정동_코드"]
numeric_cols = [col for col in numeric_cols if col not in exclude_cols]

# ---------------------------
# 4. 연 단위 집계
# ---------------------------
df_year = df.groupby(group_cols, as_index=False)[numeric_cols].sum()

# ---------------------------
# 5. 자치구 코드 생성
# ---------------------------
df_year["자치구_코드"] = df_year["행정동_코드"].astype(str).str[:5].astype(int)

# ---------------------------
# 6. 자치구 이름 매핑
# ---------------------------
gu_map = {
    11110: "종로구", 11140: "중구", 11170: "용산구",
    11200: "성동구", 11215: "광진구", 11230: "동대문구",
    11260: "중랑구", 11290: "성북구", 11305: "강북구",
    11320: "도봉구", 11350: "노원구", 11380: "은평구",
    11410: "서대문구", 11440: "마포구", 11470: "양천구",
    11500: "강서구", 11530: "구로구", 11545: "금천구",
    11560: "영등포구", 11590: "동작구", 11620: "관악구",
    11650: "서초구", 11680: "강남구", 11710: "송파구",
    11740: "강동구"
}

df_year["자치구_코드_명"] = df_year["자치구_코드"].map(gu_map)

# ---------------------------
# 7. 컬럼 순서 재정렬
# ---------------------------
gu_code = df_year.pop("자치구_코드")
gu_name = df_year.pop("자치구_코드_명")

df_year.insert(1, "자치구_코드", gu_code)
df_year.insert(2, "자치구_코드_명", gu_name)

# ---------------------------
# 8. 결과 확인
# ---------------------------
print(df_year.head())

# ---------------------------
# 9. 저장
# ---------------------------
df_year.to_csv(
    "../../data/preprocessed/상권분석_추정매출_행정동_전처리.csv",
    index=False,
    encoding="utf-8-sig"
)